Revit 2027 API
ExtrusionAnalyzer.GetExtrusionBase Method
 Obtains the face that represents the base contour of the extrusion analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Face GetExtrusionBase()
Public Function GetExtrusionBase As Face
public:
Face^ GetExtrusionBase()
member GetExtrusionBase : unit -> Face
Return Value
Face
 The face that represents the base contour.
See Also
Reference
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace